package Twice_day13;

/**
 * @author abaka
 * @date 2019/8/7 11:58
 */

/**
 * 链接：https://www.nowcoder.com/questionTerminal/5821836e0ec140c1aa29510fd05f45fc
 * 来源：牛客网
 *
 * 请设计一个算法完成两个超长正整数的加法。
 *
 *
 *
 * 接口说明
 *
 *
 *
 *
 *  /*
 *  请设计一个算法完成两个超长正整数的加法。
 *  输入参数：
 *  String addend：加数
 *  String augend：被加数
 *  返回值：加法结果
 * */
//    public String AddLongInteger(String addend,String augend)
//        *{
//        *      /*在这里实现功能*/
//        *
//        *
//        *return null;
//        *}
//        *
//        *
//        *
//        *
//        *
//        *
//        *
//        *
//        *输入描述:
//        *
//        *输入两个字符串数字
//        *
//        *
//        *
//        *输出描述:
//        *
//        *输出相加后的结果，string型
//        *
//        *示例1
//        *输入
//        *
//        *99999999999999999999999999999999999999999999999999
//        *1
//        *
//        *输出
//        *
//        *100000000000000000000000000000000000000000000000000

